tutorials/twoFluidsNBSuspensionFoam/migrationPoiseuilleFullChannel/0/nut.fluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut.fluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -1 0 0 0 0];

internalField       uniform 0;


boundaryField
{
    "walls"
    {
        type               nutkWallFunction;
        value              $internalField;
    }

    "outlet"
    {
        type               zeroGradient;
        value              $internalField;
    }

    "inlet"
    {
        type      fixedValue;
        value              $internalField;
    }

    "symm.*"
    {
//        type symmetryPlane;
        type empty;
    }
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
