tutorials/twoFluidsNBSuspensionFoam/migrationPoiseuilleFullChannel/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
option1
{
    type            meanVelocityForce;

    selectionMode   all;                    // Apply force to all cells
    fields          (U.fluid);        // Name of velocity field
    Ubar            (0.0002 0 0);             // Desired mean velocity
    relaxation      0.3;                    // Optional relaxation factor

} */

//************************************************************************* //
